<?php
/*
=====================================================
 Файл: del.offers_post.php
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Назначение: удаление объявления
=====================================================
*/

//-------------------------------------------------====
//	Инициализация
//-------------------------------------------------====

define( "ROOT_DIR", "../../../../.." );
define( "ENGINE_DIR", "../../../.." );
require_once( ENGINE_DIR."/ajax/offers/admin/OptAjax.php" );

//-------------------------------------------------====
//	Само удаление
//-------------------------------------------------====

$id = intval( $_REQUEST['id'] );
if( $id )
	{
		$result = $db->query( "SELECT `id`,`category` FROM ".PREFIX."_offers_post WHERE `id`='{$id}'" );
		if( $db->num_rows( $result ) > 0 )
			{
				while( $row = $db->get_row( $result ) )
					{
						$Offers->DelPostCategory( $row['category'] );
						$db->query( "DELETE FROM ".PREFIX."_offers_comments WHERE `offers_id`='{$id}'" );
						$db->query( "DELETE FROM ".PREFIX."_offers_post WHERE `id`='{$id}' LIMIT 1" );
					}
			}
				else
			{
				echoReturn( "Указанный оффер не найден, возможно он был удален ранее!" );
			}
	}
		else
	{
		echoReturn( "Не указан идентификатор объявления!" );
	}

//-------------------------------------------------====
//	Завершение работы
//-------------------------------------------------====

$db->close();

?>