<?php
/*
=====================================================
 Файл: save.php
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Назначение: ajax сохранение настроек модуля
=====================================================
*/

//-------------------------------------------------====
//	Инициализация
//-------------------------------------------------====

define( "ROOT_DIR", "../../../.." );
define( "ENGINE_DIR", "../../.." );
require_once( ENGINE_DIR."/ajax/banki/admin/OptAjax.php" );

//-------------------------------------------------====
//	Само сохранение
//-------------------------------------------------====

$Banki->SaveConfig( $_REQUEST['save_con'], $Banki->Config, "\$BankiConfig", ENGINE_DIR."/data/banki.config.php", "Конфигурация модуля Банки 2.0", true );

// Сразу очистим весь кэш модуля
$Banki->CleareAllCache();

//-------------------------------------------------====
//	Вывод данных
//-------------------------------------------------====

echo "<span style=\"color: green; font-weight: bold;\">Сохранено</span>";

//-------------------------------------------------====
//	Завершение работы
//-------------------------------------------------====

$db->close();

?>