<?php
/*
=====================================================
 Файл: com-edit.php
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Назначение: ajax редактирование комментариев
=====================================================
*/

//-------------------------------------------------====
//	Инициализация
//-------------------------------------------------====

define( "ROOT_DIR", "../../.." );
define( "ENGINE_DIR", "../.." );

$OptAjax = array(
	"tpl" => true,
);

require_once( ENGINE_DIR."/ajax/banki/OptAjax.php" );

//-------------------------------------------------====
//	Принятие и проверка данных
//-------------------------------------------------====

$BankiAjax = true;
require( ENGINE_DIR."/inc/banki/list/add_post.php" );

//-------------------------------------------------====
//	Завершаем работу
//-------------------------------------------------====

$db->close();

?>