<?php


//-------------------------------------------------====
//	Инициализация
//-------------------------------------------------====

define( "ROOT_DIR", "../../../.." );
define( "ENGINE_DIR", "../../.." );
require_once( ENGINE_DIR."/ajax/mfo/admin/OptAjax.php" );

//-------------------------------------------------====
//	Само сохранение
//-------------------------------------------------====

$Mfo->SaveConfig( $_REQUEST['save_con'], $Mfo->Config, "\$MfoConfig", ENGINE_DIR."/data/mfo.config.php", "Конфигурация модуля Банки 2.0", true );

// Сразу очистим весь кэш модуля
$Mfo->CleareAllCache();

//-------------------------------------------------====
//	Вывод данных
//-------------------------------------------------====

echo "<span style=\"color: green; font-weight: bold;\">Сохранено</span>";

//-------------------------------------------------====
//	Завершение работы
//-------------------------------------------------====

$db->close();

?>