<?php
/*

=====================================================
 Файл: save.php
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Назначение: ajax сохранение настроек модуля
=====================================================
*/

//-------------------------------------------------====
//	Инициализация
//-------------------------------------------------====

define( "ROOT_DIR", "../../../.." );
define( "ENGINE_DIR", "../../.." );
require_once( ENGINE_DIR."/ajax/offers/admin/OptAjax.php" );

//-------------------------------------------------====
//	Само сохранение
//-------------------------------------------------====

$Offers->SaveConfig( $_REQUEST['save_con'], $Offers->Config, "\$OffersConfig", ENGINE_DIR."/data/offers.config.php", "Конфигурация модуля Офферы 1.0", true );

// Сразу очистим весь кэш модуля
$Offers->CleareAllCache();

//-------------------------------------------------====
//	Вывод данных
//-------------------------------------------------====

echo "<span style=\"color: green; font-weight: bold;\">Сохранено</span>";

//-------------------------------------------------====
//	Завершение работы
//-------------------------------------------------====

$db->close();

?>