<?php
/*
=====================================================
 Module FAQ for DataLife Engine
-----------------------------------------------------
-----------------------------------------------------
 Copyright (c) 2010-2013
=====================================================
 Данный код защищен авторскими правами
=====================================================
 Файл: /engine/inc/faq.php
-----------------------------------------------------
 Назначение: файл подключения админки
=====================================================
*/
if(!defined('DATALIFEENGINE')){die("Hacking attempt!");}


define('MOD_DIR', ENGINE_DIR.'/modules/faq'); // Путь к файлам с модуля

include_once MOD_DIR.'/init.php';
include_once ADMIN_DIR.'/faq.php';
?>